app/controllers/application_controller.rb

  def current_user
    return nil if session[:session_token].nil?
    User.find_by_session_token(session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "DdB_pJyX9swcMNk3iHWohw"], ["LIMIT", 1]]