app/controllers/cat_rental_requests_controller.rb

SELECT "cats".* FROM "cats"
---
  def new
    if params.key?(:cat_id)
      @rental = CatRentalRequest.new(cat_id: params[:cat_id])
    else
      @rental = CatRentalRequest.new
    end

    @cats = Cat.all

SELECT "cats".* FROM "cats"
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 1], ["start_date", "2019-05-03"], ["end_date", "2019-05-03"], ["created_at", "2019-05-03 04:50:18.926126"], ["updated_at", "2019-05-03 04:50:18.926126"], ["user_id", 1]]
---
  def create
    @rental = CatRentalRequest.new(rental_params)
    @rental.user_id = current_user.id
    @cats = Cat.all

    if @rental.save

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
  def approve
    @rental = CatRentalRequest.find_by_id(params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def deny
    @rental = CatRentalRequest.find_by_id(params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def not_cat_owner
    return if current_user == CatRentalRequest.find_by_id(params[:id]).cat.owner