app/models/cat_rental_request.rb

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2019-05-03 07:34:13.601187"], ["id", 20]]
---
  def approve!
    raise 'Not Pending' unless pending?

    CatRentalRequest.transaction do
      self.status = 'APPROVED'
      self.save!

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2019-04-27 08:20:38.466370"], ["id", 1]]
---
  def deny!
    self.status = 'DENIED'
    self.save

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 AND "cat_rental_requests"."id" != $2 AND NOT (start_date > '2019-04-29' AND start_date > '2019-04-30' OR end_date < '2019-04-29') AND "cat_rental_requests"."status" = $3  [["cat_id", 1], ["id", 4], ["status", "PENDING"]]
---
  def self.cancel_expired_requests
    expired = CatRentalRequest.where('start_date < ? AND status = ?', Date.current, 'PENDING')

    expired.each { |req| req.deny! }

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def overlapping_requests
    CatRentalRequest.where(cat_id: self.cat_id)
      .where.not(id: self.id)
      .where.not('start_date > ? AND start_date > ? OR end_date < ?', self.start_date, self.end_date, self.start_date)

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 AND "cat_rental_requests"."id" != $2 AND NOT (start_date > '2022-05-03' AND start_date > '2542-05-03' OR end_date < '2022-05-03') AND "cat_rental_requests"."status" = $3  [["cat_id", 7], ["id", 19], ["status", "PENDING"]]
---
  def overlapping_approved_requests
    overlapping_requests.where(status: 'APPROVED')

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 AND "cat_rental_requests"."id" != $2 AND NOT (start_date > '2019-05-22' AND start_date > '2019-05-30' OR end_date < '2019-05-22') AND "cat_rental_requests"."status" = $3  [["cat_id", 3], ["id", 20], ["status", "PENDING"]]
---
  def overlapping_pending_requests
    overlapping_requests.where(status: 'PENDING')

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2019-05-03 00:05:28.270109"], ["id", 14]]
---
  def deny_overlapping!
    overlapping_pending_requests.each do |req|
      req.status = 'DENIED'
      req.save!