app/models/cat_rental_request.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def overlapping_requests
    CatRentalRequest.where(cat_id: self.cat_id)
      .where.not(id: self.id)
      .where('start_date BETWEEN ? AND ? OR end_date BETWEEN ? AND ?', self.start_date, self.end_date, self.start_date, self.end_date)