app/models/user.rb

  def self.find_by_credentials(user_name, pw)
    user = User.find_by_username(user_name)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "bats"], ["LIMIT", 1]]

  def self.generate_session_token
    token = SecureRandom::urlsafe_base64(16)
    token = SecureRandom::urlsafe_base64(16) while User.find_by_session_token(token)
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "hbc7q_8Qet_X8yOpZC8CtQ"], ["LIMIT", 1]]